---
kind: property
id: P:Autodesk.Revit.DB.IFC.ExporterIFC.ExportAs2x2
source: html/34c4b8b7-5e12-f337-c16e-23c3012916b0.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFC.ExportAs2x2 Property

Identifies if the file version being exported is 2x2.

## Syntax (C#)
```csharp
public bool ExportAs2x2 { get; }
```

## Remarks
Returns true even for alternative formats equivalent to 2x2, such as BCA.